Информационная_база/src/Catalogs/ШаблоныНаименований/ШаблоныНаименований.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ШаблоныНаименований</name>
  <owners>Catalog.КатегорииНоменклатуры</owners>
  <attributes>
    <name>ВидНаименования</name>
    <type>
      <types>EnumRef.ВидыНаименованийОбъектов</types>
    </type>
  </attributes>
  <attributes>
    <name>ДляХарактеристики</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>НаборСвойств</name>
    <type>
      <types>CatalogRef.НаборыДополнительныхРеквизитовИСведений</types>
    </type>
  </attributes>
  <attributes>
    <name>РеквизитДопУпорядочивания</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Рекурсивный</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ШаблонДляПредставления</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ШаблонДляФормирования</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ЭтоПредопределенный</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
</mdclass:Catalog>

Информационная_база/src/Enums/ВидыНаименованийОбъектов/ВидыНаименованийОбъектов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыНаименованийОбъектов</name>
  <enumValues>
    <name>ХарактеристикаРабочее</name>
  </enumValues>
  <enumValues>
    <name>ХарактеристикаДляПечати</name>
  </enumValues>
  <enumValues>
    <name>НоменклатураРабочее</name>
  </enumValues>
  <enumValues>
    <name>НоменклатураДляПечати</name>
  </enumValues>
</mdclass:Enum>

Информационная_база/src/Catalogs/КатегорииНоменклатуры/КатегорииНоменклатуры.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>КатегорииНоменклатуры</name>
  <hierarchical>true</hierarchical>
  <predefined>
    <items>
      <name>БезКатегории</name>
      <description>&lt;Без категории></description>
    </items>
  </predefined>
  <attributes>
    <name>Весовой</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидАлкогольнойПродукции</name>
    <type>
      <types>CatalogRef.ВидыАлкогольнойПродукции</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидСтавкиНДС</name>
    <type>
      <types>EnumRef.ВидыСтавокНДС</types>
    </type>
  </attributes>
  <attributes>
    <name>ЕдиницаИзмерения</name>
    <type>
      <types>CatalogRef.КлассификаторЕдиницИзмерения</types>
    </type>
  </attributes>
  <attributes>
    <name>ИмпортнаяАлкогольнаяПродукция</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИспользоватьХарактеристики</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>КатегорияПоКлассификатору</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>15</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>МетодОценки</name>
    <type>
      <types>EnumRef.МетодОценкиЗапасов</types>
    </type>
  </attributes>
  <attributes>
    <name>НаборСвойств</name>
    <type>
      <types>CatalogRef.НаборыДополнительныхРеквизитовИСведений</types>
    </type>
  </attributes>
  <attributes>
    <name>НаборСвойствХарактеристики</name>
    <type>
      <types>CatalogRef.НаборыДополнительныхРеквизитовИСведений</types>
    </type>
  </attributes>
  <attributes>
    <name>НаправлениеДеятельности</name>
    <type>
      <types>CatalogRef.НаправленияДеятельности</types>
    </type>
  </attributes>
  <attributes>
    <name>ПроверятьЗаполнениеХарактеристики</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>РеквизитДопУпорядочивания</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Склад</name>
    <type>
      <types>CatalogRef.СтруктурныеЕдиницы</types>
    </type>
  </attributes>
  <attributes>
    <name>СчетУчетаДоходов</name>
    <type>
      <types>ChartOfAccountsRef.Управленческий</types>
    </type>
  </attributes>
  <attributes>
    <name>СчетУчетаЗапасов</name>
    <type>
      <types>ChartOfAccountsRef.Управленческий</types>
    </type>
  </attributes>
  <attributes>
    <name>СчетУчетаЗатрат</name>
    <type>
      <types>ChartOfAccountsRef.Управленческий</types>
    </type>
  </attributes>
  <attributes>
    <name>СрокИсполненияЗаказа</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТипНоменклатурыПоУмолчанию</name>
    <type>
      <types>EnumRef.ТипыНоменклатуры</types>
    </type>
  </attributes>
  <attributes>
    <name>ШаблонЦенника</name>
    <type>
      <types>CatalogRef.ХранилищеШаблонов</types>
    </type>
  </attributes>
  <attributes>
    <name>ШаблонЭтикетки</name>
    <type>
      <types>CatalogRef.ХранилищеШаблонов</types>
    </type>
  </attributes>
  <attributes>
    <name>ИспользоватьПроизводителяВЕТИСПартии</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИспользоватьЗаписьСкладскогоЖурналаВЕТИСПартии</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИспользоватьИдентификаторПартииВЕТИСПартии</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИспользоватьДатуПроизводстваПартии</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИспользоватьСрокГодностиПартии</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>АвтоматическиГенерироватьПартии</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИспользоватьНомерПартии</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПодконтрольнаяПродукцияВЕТИС</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СпособПополнения</name>
    <type>
      <types>EnumRef.СпособыПополненияЗапасов</types>
    </type>
  </attributes>
  <attributes>
    <name>ЦеноваяГруппа</name>
    <type>
      <types>CatalogRef.ЦеновыеГруппы</types>
    </type>
  </attributes>
  <attributes>
    <name>Ячейка</name>
    <type>
      <types>CatalogRef.Ячейки</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ПорядокСортировки</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

Информационная_база/src/Catalogs/ШаблоныНаименований/Forms/ФормаСписка/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Отбор.Свойство("Владелец") Тогда
		Владелец = Параметры.Отбор.Владелец;
	Иначе
		Владелец = Справочники.КатегорииНоменклатуры.ПустаяСсылка();
	КонецЕсли;
	
	ВидНаименования = Неопределено;
	Параметры.Свойство("ВидНаименования", ВидНаименования);
	
	УправлениеВидимостьюФормы(ВидНаименования);
	
	ПриИзмененииВладельца();
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПараметрыРазмещения = ПодключаемыеКоманды.ПараметрыРазмещения();
	ПараметрыРазмещения.КоманднаяПанель = Элементы.ГруппаКоманднаяПанель;
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект, ПараметрыРазмещения);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийКомандФормы

&НаКлиенте
Процедура СоздатьШаблонДляНоменклатуры(Команда)
	
	СтруктураПараметров = Новый Структура("ДляХарактеристики,Владелец", Ложь, Владелец);
	ОткрытьФорму("Справочник.ШаблоныНаименований.ФормаОбъекта", СтруктураПараметров, ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура СоздатьШаблонДляХарактеристики(Команда)
	
	СтруктураПараметров = Новый Структура("ДляХарактеристики,Владелец", Истина, Владелец);
	ОткрытьФорму("Справочник.ШаблоныНаименований.ФормаОбъекта", СтруктураПараметров, ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура СоздатьШаблон(Команда)
	
	СтруктураПараметров = Новый Структура("ДляХарактеристики,Владелец", ДляХарактеристики, Владелец);
	ОткрытьФорму("Справочник.ШаблоныНаименований.ФормаОбъекта", СтруктураПараметров, ЭтаФорма);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовФормы

&НаКлиенте
Процедура ВладелецПриИзменении(Элемент)
	
	ПриИзмененииВладельца();
	
КонецПроцедуры

&НаКлиенте
Процедура СписокПриАктивизацииСтроки(Элемент)
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиент.НачатьОбновлениеКоманд(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ПриИзмененииВладельца()
	
	Если ЗначениеЗаполнено(Владелец) Тогда
		
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(
			Список, "Владелец", Владелец
		);
		
		Элементы.СписокВладелец.Видимость = Ложь;
		Элементы.СоздатьШаблон.Доступность = Истина;
		Элементы.ГруппаСоздать.Доступность = Истина;
		
	Иначе
		
		ОбщегоНазначенияКлиентСервер.УдалитьЭлементыГруппыОтбораДинамическогоСписка(
			Список, "Владелец"
		);
		
		Элементы.СписокВладелец.Видимость = Истина;
		Элементы.СоздатьШаблон.Доступность = Ложь;
		Элементы.ГруппаСоздать.Доступность = Ложь;
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура УправлениеВидимостьюФормы(ВидНаименования)
	
	ГруппаКоманд = Элементы.Найти("НастройкаПорядкаЭлементов");
	
	Если ЗначениеЗаполнено(Владелец) Тогда
		Если ГруппаКоманд <> Неопределено Тогда
			ГруппаКоманд.Видимость = Истина;
		КонецЕсли;
		Элементы.Владелец.Видимость = Ложь;
	Иначе
		Если ГруппаКоманд <> Неопределено Тогда
			ГруппаКоманд.Видимость = Ложь;
		КонецЕсли;
		Элементы.Владелец.Видимость = Истина;
	КонецЕсли;
	
	Если ВидНаименования = Неопределено
		ИЛИ НЕ ЗначениеЗаполнено(Владелец) Тогда
		
		Если ЗначениеЗаполнено(Владелец) Тогда
			ЕстьХарактеристики = Владелец.ИспользоватьХарактеристики;
		Иначе
			ЕстьХарактеристики = ПолучитьФункциональнуюОпцию("ИспользоватьХарактеристики");
		КонецЕсли;
		
		Если ЕстьХарактеристики Тогда
			Элементы.СоздатьШаблон.Видимость = Ложь;
			Элементы.ГруппаСоздать.Видимость = Истина;
			Элементы.ДляХарактеристикиПредставление.Видимость = Истина;
		Иначе
			Элементы.СоздатьШаблон.Видимость = Истина;
			Элементы.ГруппаСоздать.Видимость = Ложь;
			Элементы.ДляХарактеристикиПредставление.Видимость = Ложь;
		КонецЕсли;
		
		Если ЕстьХарактеристики Тогда
			Возврат;
		КонецЕсли;
		
		УправлениеНебольшойФирмойКлиентСервер.УстановитьЭлементОтбораСписка(
			Список, "ДляХарактеристики", Ложь
		);
		
	ИначеЕсли ВидНаименования = Перечисления.ВидыНаименованийОбъектов.НоменклатураРабочее
		ИЛИ ВидНаименования = Перечисления.ВидыНаименованийОбъектов.НоменклатураДляПечати Тогда
		
		ДляХарактеристики = Ложь;
		
		Элементы.СоздатьШаблон.Видимость = Истина;
		Элементы.ГруппаСоздать.Видимость = Ложь;
		Элементы.ДляХарактеристикиПредставление.Видимость = Ложь;
		
		УправлениеНебольшойФирмойКлиентСервер.УстановитьЭлементОтбораСписка(
			Список, "ДляХарактеристики", ДляХарактеристики
		);
		
	ИначеЕсли ВидНаименования = Перечисления.ВидыНаименованийОбъектов.ХарактеристикаРабочее
		ИЛИ ВидНаименования = Перечисления.ВидыНаименованийОбъектов.ХарактеристикаДляПечати Тогда
		
		ДляХарактеристики = Истина;
		
		Элементы.СоздатьШаблон.Видимость = Истина;
		Элементы.ГруппаСоздать.Видимость = Ложь;
		Элементы.ДляХарактеристикиПредставление.Видимость = Ложь;
		
		УправлениеНебольшойФирмойКлиентСервер.УстановитьЭлементОтбораСписка(
			Список, "ДляХарактеристики", ДляХарактеристики
		);
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиБиблиотек

// СтандартныеПодсистемы.ПодключаемыеКоманды
&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
	ПодключаемыеКомандыКлиент.ВыполнитьКоманду(ЭтотОбъект, Команда, Элементы.Список);
КонецПроцедуры

&НаСервере
Процедура Подключаемый_ВыполнитьКомандуНаСервере(Контекст, Результат)
	ПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, Контекст, Элементы.Список, Результат);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Элементы.Список);
КонецПроцедуры
// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

#КонецОбласти
